### Designing a Bank Marketing Database

### Problem Statement

You have been asked to work with a bank to clean and store the data they collected as part of a recent marketing campaign, which aimed to get customers to take out a personal loan. They plan to conduct more marketing campaigns going forward so would like you to set up a PostgreSQL database to store this campaign's data, designing the schema in a way that would allow data from future campaigns to be easily imported.

They have supplied you with a csv file called "bank_marketing.csv", which you will need to clean, reformat, and split, in order to save separate files based on the tables you will create. It is recommended to use pandas for these tasks.

Lastly, you will write the SQL code that the bank can execute to create the tables and populate with the data from the csv files. As the bank are quite strict about their security, you'll save SQL files as multiline string variables that they can then use to create the database on their end.

You have been asked to design a database that will have three tables:

## client
| column | data type | description | original column in dataset |
|--------|-----------|-------------|----------------------------|
| `id` | `serial` | Client ID - primary key | `client_id` |
| `age` | `integer` | Client's age in years | `age` |
| `job` | `text` | Client's type of job | `job` |
| `marital` | `text` | Client's marital status | `marital` | 
| `education` | `text` | Client's level of education | `education` |
| `credit_default` | `boolean` | Whether the client's credit is in default | `credit_default` |
| `housing` | `boolean` | Whether the client has an existing housing loan (mortgage) | `housing` | 
| `loan` | `boolean` | Whether the client has an existing personal loan | `loan` |

## campaign

| column | data type | description | original column in dataset |
|--------|-----------|-------------|----------------------------|
| `campaign_id` | `serial` | Campaign ID - primary key | N/A - new column |
| `client_id` | `serial` | Client ID - references `id` in the `client` table | `client_id` |
| `number_contacts` | `integer` | Number of contact attempts to the client in the current campaign | `campaign` |
| `contact_duration` | `integer` | Last contact duration in seconds | `duration` |
| `pdays` | `integer` | Number of days since contact in previous campaign (`999` = not previously contacted) | `pdays` |
| `previous_campaign_contacts` | `integer` | Number of contact attempts to the client in the previous campaign | `previous` |
| `previous_outcome` | `boolean` | Outcome of the previous campaign | `poutcome` |
| `campaign_outcome` | `boolean` | Outcome of the current campaign | `y` |
| `last_contact_date` | `date` | Last date the client was contacted | A combination of `day`, `month`, and the newly created `year` |

## economics

| column | data type | description | original column in dataset |
|--------|-----------|-------------|----------------------------|
| `client_id` | `serial` | Client ID - references `id` in the `client` table | `client_id` |
| `emp_var_rate` | `float` | Employment variation rate (quarterly indicator) | `emp_var_rate` |
| `cons_price_idx` | `float` | Consumer price index (monthly indicator) | `cons_price_idx` |
| `euribor_three_months` | `float` | Euro Interbank Offered Rate (euribor) three month rate (daily indicator) | `euribor3m` |
| `number_employed` | `float` | Number of employees (quarterly indicator)| `nr_employed` |

In [2]:
# Import libraries
import pandas as pd
import numpy as np

# suppress warnings from final output
import warnings
warnings.simplefilter("ignore")

#### Step 1:  Read in bank_marketing.csv as a pandas DataFrame.

In [3]:
# Read in bank_marketing.csv as a pandas DataFrame.
bank_marketing_data = pd.read_csv("bank_marketing.csv")
bank_marketing_data.head()

,client_id,age,job,marital,education,credit_default,housing,loan,contact,month,...,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
0,0,56,housemaid,married,basic.4y,no,no,no,telephone,may,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,1,57,services,married,high.school,unknown,no,no,telephone,may,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,2,37,services,married,high.school,no,yes,no,telephone,may,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,3,40,admin.,married,basic.6y,no,no,no,telephone,may,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,4,56,services,married,high.school,no,no,yes,telephone,may,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

#### Step 2:

Split the data into three DataFrames using information provided about the desired tables as your guide: 

* one with information about the client, 
* another containing campaign data, and 
* a third to store information about economics at the time of the campaign.

In [4]:
# Define the columns for each table
client_columns = ['client_id', 'age', 'job', 'marital', 'education', 'credit_default', 'housing', 'loan']
campaign_columns = ['client_id', 'campaign', 'duration', 'pdays', 'previous', 'poutcome', 'y', 'month', 'day']
economic_columns = ['client_id', 'emp_var_rate', 'cons_price_idx', 'euribor3m', 'nr_employed']

# Create Dataframes for each table
client = bank_marketing_data[client_columns]
campaign = bank_marketing_data[campaign_columns]
economics = bank_marketing_data[economic_columns]

# Print the first few rows of each DataFrame to verify the split
print("Client Data:")
print(client.head())

print("\nCampaign Data:")
print(campaign.head())

print("\nEconomic Data:")
print(economics.head())

Client Data:
   client_id  age        job  marital    education credit_default housing loan
0          0   56  housemaid  married     basic.4y             no      no   no
1          1   57   services  married  high.school        unknown      no   no
2          2   37   services  married  high.school             no     yes   no
3          3   40     admin.  married     basic.6y             no      no   no
4          4   56   services  married  high.school             no      no  yes

Campaign Data:
   client_id  campaign  duration  pdays  previous     poutcome   y month  day
0          0         1       261    999         0  nonexistent  no   may   13
1          1         1       149    999         0  nonexistent  no   may   19
2          2         1       226    999         0  nonexistent  no   may   23
3          3         1       151    999         0  nonexistent  no   may   27
4          4         1       307    999         0  nonexistent  no   may    3

Economic Data:
   client_id  emp_var_rate  cons_price_idx  euribor3m  nr_employed
0          0           1.1          93.994      4.857       5191.0
1          1           1.1          93.994      4.857       5191.0
2          2           1.1          93.994      4.857       5191.0
3          3           1.1          93.994      4.857       5191.0
4          4           1.1          93.994      4.857       5191.0

#### Step 3:

Rename the column "client_id" to "id" in client; "duration" to "contact_duration",
"previous" to "previous_campaign_contacts", "y" to "campaign_outcome", "poutcome" to "previous_outcome", and 
"campaign" to "number_contacts" in campaign; and "euribor3m" to "euribor_three_months" and "nr_employed" to
"number_employed" in economics.

In [5]:
# Rename columns in the client DataFrame
client.rename(columns={'client_id': 'id'}, inplace=True)

# Rename columns in the campaign DataFrame
campaign.rename(columns={'duration': 'contact_duration',
                             'previous': 'previous_campaign_contacts',
                             'y': 'campaign_outcome',
                             'poutcome': 'previous_outcome',
                             'campaign': 'number_contacts'}, inplace=True)

# Rename columns in the economic DataFrame
economics.rename(columns={'euribor3m': 'euribor_three_months',
                             'nr_employed': 'number_employed'}, inplace=True)

# Print the first few rows of each DataFrame to verify the renaming of columns
print("Client Data:")
print(client.head())

print("\nCampaign Data:")
print(campaign.head())

print("\nEconomic Data:")
print(economics.head())

Client Data:
   id  age        job  marital    education credit_default housing loan
0   0   56  housemaid  married     basic.4y             no      no   no
1   1   57   services  married  high.school        unknown      no   no
2   2   37   services  married  high.school             no     yes   no
3   3   40     admin.  married     basic.6y             no      no   no
4   4   56   services  married  high.school             no      no  yes

Campaign Data:
   client_id  number_contacts  contact_duration  pdays  \
0          0                1               261    999
1          1                1               149    999
2          2                1               226    999
3          3                1               151    999
4          4                1               307    999

   previous_campaign_contacts previous_outcome campaign_outcome month  day
0                           0      nonexistent               no   may   13
1                           0      nonexistent               no   may   19
2                           0      nonexistent               no   may   23
3                           0      nonexistent               no   may   27
4                           0      nonexistent               no   may    3

Economic Data:
   client_id  emp_var_rate  cons_price_idx  euribor_three_months  \
0          0           1.1          93.994                 4.857
1          1           1.1          93.994                 4.857
2          2           1.1          93.994                 4.857
3          3           1.1          93.994                 4.857
4          4           1.1          93.994                 4.857

   number_employed
0           5191.0
1           5191.0
2           5191.0
3           5191.0
4           5191.0

#### Step 4:

Clean the "education" column, changing "." to "_" and "unknown" to NumPy's null values.

In [6]:
# Replace "." with "_"
client['education'] = client['education'].str.replace('.', '_')

# Replace "unknown" with Numpy's NaN
client['education'].replace('unknown', np.nan, inplace=True)

In [7]:
# Check for "." in the "education" column
dot_count = client['education'].str.contains('\.').sum()

# Check for "unknown" in the "education" column
unknown_count = (client['education'] == 'unknown').sum()

if dot_count == 0 and unknown_count == 0:
    print("The 'education' column has been successfully cleaned.")
else:
    print(f"The 'education' column still contains {dot_count} '.' and {unknown_count} 'unknown' values.")

The 'education' column has been successfully cleaned.

#### Step 5:

Remove periods from the "job" column.

In [8]:
# Remove "." from the "job" column
client['job'] = client['job'].str.replace('.', '')

# Check if periods are removed
if '.' not in client['job'].values:
    print("Periods have been successfully removed from the 'job' column.")
else:
    print("Periods still exist in the job column.")

Periods have been successfully removed from the 'job' column.

#### Step 6:

Convert "success" and "failure" in the "previous_outcome" and "campaign_outcome" columns to binary (1 or 0), 
along with the changing "nonexistent" to NumPy's null values in "previous_outcome".

In [9]:
# Convert "success" and "failure" to binary (1 or 0) in "previous_outcome" and "campaign_outcome"
campaign['previous_outcome'] = campaign['previous_outcome'].map({'success': 1, 'failure': 0})
campaign['campaign_outcome'] = campaign['campaign_outcome'].map({'success': 1, 'failure': 0})

# Change "nonexistent" to Numpy's NaN in "previous_outcome"
campaign['previous_outcome'].replace('nonexistent', np.nan, inplace=True)

# Check if the conversions and changes are applied
if ('success' not in campaign['previous_outcome'].values and
    'failure' not in campaign['previous_outcome'].values and
    'nonexistent' not in campaign['previous_outcome'].values and
    'success' not in campaign['campaign_outcome'].values and
    'failure' not in campaign['campaign_outcome'].values):
    print("Conversions and changes in 'previous_outcome' and 'campaign_outcome' columns were successfully applied.")
else:
    print("Conversions and changes were not fully applied in 'previous_outcome' and 'campaign_outcome' columns.")

Conversions and changes in 'previous_outcome' and 'campaign_outcome' columns were successfully applied.

#### Step 7:

Add a column called campaign_id in campaign, where all rows have a value of 1.

In [10]:
# Add a new column 'campaign_id' with all values set to 1
campaign['campaign_id'] = 1

# Check if column was succsssfully created
campaign.head()

,client_id,number_contacts,contact_duration,pdays,previous_campaign_contacts,previous_outcome,campaign_outcome,month,day,campaign_id
0,0,1,261,999,0,NaN,NaN,may,13,1
1,1,1,149,999,0,NaN,NaN,may,19,1
2,2,1,226,999,0,NaN,NaN,may,23,1
3,3,1,151,999,0,NaN,NaN,may,27,1
4,4,1,307,999,0,NaN,NaN,may,3,1

#### Step 8:

Create a datetime column called last_contact_date, in the format of "year-month-day", where the year is 2022, and the month and day values are taken from the "month" and "day" columns.

In [11]:
# Add the "year" column with the value 2022 to the 'campaign_data' DataFrame
campaign['year'] = 2022

# Create a datetime column "last_contact_date"
campaign['last_contact_date'] = pd.to_datetime(
    campaign['year'].astype(str) + '-' +
    campaign['month'].astype(str) + '-' +
    campaign['day'].astype(str),
    errors='coerce'
)

# Check if the "last_contact_date" column was successfully created.
if 'last_contact_date' in campaign.columns:
    print("The 'last_contact_date' column was successfully created.")
else:
    print("The 'last_contact_date' column was not created.")

# Print the first few rows of 'campaign_data' DataFrame to verify the creation of the date column
campaign.head()

The 'last_contact_date' column was successfully created.

,client_id,number_contacts,contact_duration,pdays,previous_campaign_contacts,previous_outcome,campaign_outcome,month,day,campaign_id,year,last_contact_date
0,0,1,261,999,0,NaN,NaN,may,13,1,2022,2022-05-13
1,1,1,149,999,0,NaN,NaN,may,19,1,2022,2022-05-19
2,2,1,226,999,0,NaN,NaN,may,23,1,2022,2022-05-23
3,3,1,151,999,0,NaN,NaN,may,27,1,2022,2022-05-27
4,4,1,307,999,0,NaN,NaN,may,3,1,2022,2022-05-03

In [12]:
# Confirm the last_contact_date is in datetime format
campaign['last_contact_date'].dtype

dtype('<M8[ns]')

#### Instruction 9:

Remove any redundant data that might have been used to create new columns, ensuring the columns in each subset of the data match the table displayed in the notebook.

In [13]:
# Remove "day", "month", and "year" columns that were used to create the "last_contact_date" column
campaign = campaign.drop(['day', 'month', 'year'], axis=1)

# Print the first few rows of each of the DataFrame to verify they match tables expected to be created.
print("Client Data:")
print(client.head())

print("\nCampaign Data:")
print(campaign.head())

print("\nEconomic Data:")
print(economics.head())

Client Data:
   id  age        job  marital    education credit_default housing loan
0   0   56  housemaid  married     basic_4y             no      no   no
1   1   57   services  married  high_school        unknown      no   no
2   2   37   services  married  high_school             no     yes   no
3   3   40      admin  married     basic_6y             no      no   no
4   4   56   services  married  high_school             no      no  yes

Campaign Data:
   client_id  number_contacts  contact_duration  pdays  \
0          0                1               261    999
1          1                1               149    999
2          2                1               226    999
3          3                1               151    999
4          4                1               307    999

   previous_campaign_contacts  previous_outcome  campaign_outcome  \
0                           0               NaN               NaN
1                           0               NaN               NaN
2                           0               NaN               NaN
3                           0               NaN               NaN
4                           0               NaN               NaN

   campaign_id last_contact_date
0            1        2022-05-13
1            1        2022-05-19
2            1        2022-05-23
3            1        2022-05-27
4            1        2022-05-03

Economic Data:
   client_id  emp_var_rate  cons_price_idx  euribor_three_months  \
0          0           1.1          93.994                 4.857
1          1           1.1          93.994                 4.857
2          2           1.1          93.994                 4.857
3          3           1.1          93.994                 4.857
4          4           1.1          93.994                 4.857

   number_employed
0           5191.0
1           5191.0
2           5191.0
3           5191.0
4           5191.0

#### Step 10:

Save the three DataFrames to csv files without an index as client.csv, campaign.csv, and economics.csv respectively.

In [14]:
# Save client data to 'client.csv'
client.to_csv('client.csv', index=False)

# Save campaign data to 'campaign.csv'
campaign.to_csv('campaign.csv', index=False)

# Save economics data to 'economics.csv'
economics.to_csv('economics.csv', index=False)

#### Step 11:

Create a Python variable called client_table, containing SQL code as a multi-line string to create a table called client using values from client.csv.

In [15]:
# Specify the SQL code as a multi-line string
client_table = """
CREATE TABLE client (
    id SERIAL PRIMARY KEY,
    age INT,
    job TEXT,
    marital TEXT,
    education TEXT,
    credit_default BOOLEAN,
    housing BOOLEAN,
    loan BOOLEAN
);

-- Copy data from client.csv into the client table
\copy client FROM 'client.csv' DELIMITER ',' CSV HEADER;
"""

#### Step 12:

Create a Python variable called campaign_table, containing SQL code as a multi-line string to create a table called campaign using values from campaign.csv.

In [16]:
# Specify SQL code as a multi-line string
campaign_table = """"
CREATE TABLE campaign (
    campaign_id SERIAL PRIMARY KEY,
    client_id SERIAL REFERENCES client (id),
    number_contacts INT,
    contact_duration INT,
    pdays INT,
    previous_campaign_contacts INT,
    previous_outcome BOOLEAN,
    campaign_outcome BOOLEAN,
    last_contact_date DATE
);

-- Copy data from campaign.csv into the campaign table
\copy campaign FROM 'campaign.csv' DELIMETER ',' CSV HEADER;
"""

#### Step 13:

Create a Python variable called economics_table, containing SQL code as a multi-line string to create a table called economics using values from economics.csv.

In [17]:
# Specify SQL code as a multi-line string
economics_table = """
CREATE TABLE economics (
    client_id SERIAL REFERENCES client (id),
    emp_var_rate FLOAT,
    cons_price_idx FLOAT,
    euribor_three_months FLOAT,
    number_employed FLOAT
);

-- Copy data from economics.csv into the economics table
\copy economics FROM 'economics.csv' DELIMETER ',' CSV HEADER;
"""

## Loading the three different dataframes into a PostgreSQL database

In [19]:
# import library
import psycopg2
from sqlalchemy import create_engine

# Specify parameters
# You get these parameters from your postgresSQL DBMS server properties
hostname = 'localhost'
database = 'marketing_campaign'
username = 'postgres'
password = 'database'
port_id = 5432

# Provide connection parameters
conn = psycopg2.connect(
    host=hostname,
    database=database,
    user=username,
    password=password,
    port=port_id
)

In [20]:
# Create engine
# connection string: dialect+driver://user:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:database@localhost/marketing_campaign')

In [21]:
# Display engine info
engine

Engine(postgresql+psycopg2://postgres:***@localhost/marketing_campaign)

In [22]:
# Insert data from client DataFrame into the "client_data" table
client.to_sql('client_data', engine, if_exists='replace', index=False)

# Insert data from campaign DataFrame into the "campaign_data" table
campaign.to_sql('campaign_data', engine, if_exists='replace', index=False)

# Insert data from economics DataFrame into the "economics_data" table
economics.to_sql('economics_data', engine, if_exists='replace', index=False)

188

In [23]:
# Confirm if all three tables were successfully created 
# and if all the data was successfully inserted into the three different tables

# Read client_data from database to pandas dataframe
client_df = pd.read_sql_query('SELECT * FROM client_data', engine)
client_df

,id,age,job,marital,education,credit_default,housing,loan
0,0,56,housemaid,married,basic_4y,no,no,no
1,1,57,services,married,high_school,unknown,no,no
2,2,37,services,married,high_school,no,yes,no
3,3,40,admin,married,basic_6y,no,no,no
4,4,56,services,married,high_school,no,no,yes
...,...,...,...,...,...,...,...,...
41183,41183,73,retired,married,professional_course,no,yes,no
41184,41184,46,blue-collar,married,professional_course,no,no,no
41185,41185,56,retired,married,university_degree,no,yes,no
41186,41186,44,technician,married,professional_course,no,no,no
41187,41187,74,retired,married,professional_course,no,yes,no

In [24]:
# Read campaign_data from database to pandas dataframe
campaign_df = pd.read_sql_query('SELECT * FROM campaign_data', engine)
campaign_df

,client_id,number_contacts,contact_duration,pdays,previous_campaign_contacts,previous_outcome,campaign_outcome,campaign_id,last_contact_date
0,0,1,261,999,0,NaN,None,1,2022-05-13
1,1,1,149,999,0,NaN,None,1,2022-05-19
2,2,1,226,999,0,NaN,None,1,2022-05-23
3,3,1,151,999,0,NaN,None,1,2022-05-27
4,4,1,307,999,0,NaN,None,1,2022-05-03
...,...,...,...,...,...,...,...,...,...
41183,41183,1,334,999,0,NaN,None,1,2022-11-30
41184,41184,1,383,999,0,NaN,None,1,2022-11-06
41185,41185,2,189,999,0,NaN,None,1,2022-11-24
41186,41186,1,442,999,0,NaN,None,1,2022-11-17
41187,41187,3,239,999,1,0.0,None,1,2022-11-23

In [25]:
# Read economics_data from database to pandas dataframe
economics_df = pd.read_sql_query('SELECT * FROM economics_data', engine)
economics_df

,client_id,emp_var_rate,cons_price_idx,euribor_three_months,number_employed
0,0,1.1,93.994,4.857,5191.0
1,1,1.1,93.994,4.857,5191.0
2,2,1.1,93.994,4.857,5191.0
3,3,1.1,93.994,4.857,5191.0
4,4,1.1,93.994,4.857,5191.0
...,...,...,...,...,...
41183,41183,-1.1,94.767,1.028,4963.6
41184,41184,-1.1,94.767,1.028,4963.6
41185,41185,-1.1,94.767,1.028,4963.6
41186,41186,-1.1,94.767,1.028,4963.6
41187,41187,-1.1,94.767,1.028,4963.6

### The End!